app/views/users/show.html.erb

SELECT "slots".* FROM "slots"  WHERE "slots"."user_id" = ?  [["user_id", 8]]
SELECT COUNT(*) FROM "slots"  WHERE "slots"."user_id" = ?  [["user_id", 6]]
---
<% if @user == current_user %>
  <% if current_user.slots.count == 0 %>