app/views/shared/_slots_display.html.erb

      </tr>
      <% if user.slots.count == 0 %>
---
SELECT "slots".* FROM "slots"  WHERE "slots"."user_id" = ?  [["user_id", 6]]
SELECT COUNT(*) FROM "slots"  WHERE "slots"."user_id" = ?  [["user_id", 8]]