app/controllers/friends_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."invite_id" = '43de1d568833' LIMIT 1
---
  def create
    if User.find_by(invite_id: params[:invite_code]).class == User