app/controllers/slots_controller.rb

INSERT INTO "slots" ("created_at", "day", "end_time", "label", "start_time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @slot = Slot.new(slot_params)
    @slot.user_id = current_user.id
    if @slot.save

SELECT  "slots".* FROM "slots"  WHERE "slots"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "slots" WHERE "slots"."id" = ?  [["id", 2]]
---
  def destroy
    slot = Slot.find(params[:id])
    slot.destroy