app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.invite_id = generate_invite_id
    if @user.save
      if User.find_by(invite_id: params[:invite_code]).class == User
---
INSERT INTO "users" ("created_at", "first_name", "invite_id", "last_name", "password_digest", "time_zone", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users"  WHERE "users"."invite_id" = '772c34caea4a' LIMIT 1

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "last_name" = ?, "updated_at" = ? WHERE "users"."id" = 15  [["last_name", "Conley"], ["updated_at", "2014-09-22 14:52:09.905535"]]